In [2]:
# Let's make sure we are using Python 3
import sys
print(sys.version[0])

3

#### Install and import

conda install pandas

OR

pip install pandas

Alternatively, if you're currently viewing this article in a Jupyter notebook you can run this cell:

In [5]:
!pip install pandas

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (0.24.2)
Requirement already satisfied: pytz>=2011k in c:\programdata\anaconda3\lib\site-packages (from pandas) (2019.1)
Requirement already satisfied: python-dateutil>=2.5.0 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.0)
Requirement already satisfied: numpy>=1.12.0 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.16.4)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.5.0->pandas) (1.12.0)

In [8]:
import pandas as pd
import seaborn as sns
pd.set_option('display.max_columns', 100)

#### Reading a CSV file

In [9]:
?pd.read_csv

In [18]:
#reading JSON files
df_json = pd.read_json('titanic.json')
df_json.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
10,1,3,Miss. Marguerite Rut Sandstrom,female,4.0,1,1,16.7000
100,0,3,Mr. Pastcho Petroff,male,29.0,0,0,7.8958
101,0,1,Mr. Richard Frasar White,male,21.0,0,1,77.2875

In [19]:
#reading text files
df_text = pd.read_csv('titanic.txt')
df_text.head()

  Age\tFare\tName\tParents/Children Aboard\tPclass\tSex\tSiblings/Spouses Aboard\tSurvived
0  22.0\t7.25\tMr. Owen Harris Braund\t0\t3\tmale...
1  38.0\t71.2833\tMrs. John Bradley (Florence Bri...
2  4.0\t16.7\tMiss. Marguerite Rut Sandstrom\t1\t...
3  29.0\t7.8958\tMr. Pastcho Petroff\t0\t3\tmale\...
4  21.0\t77.2875\tMr. Richard Frasar White\t1\t1\...

In [20]:
?pd.read_csv

We are reading in the text file again because the default separater for read_csv function is ',' (a comma). However text files are usually separated by '\t' (tabs) and we have to explicitely mention that in the function signature.

In [21]:
df_text = pd.read_csv('titanic.txt',sep='\t')
df_text.head()

,Age,Fare,Name,Parents/Children Aboard,Pclass,Sex,Siblings/Spouses Aboard,Survived
0,22.0,7.2500,Mr. Owen Harris Braund,0,3,male,1,0
1,38.0,71.2833,Mrs. John Bradley (Florence Briggs Thayer) Cum...,0,1,female,1,1
2,4.0,16.7000,Miss. Marguerite Rut Sandstrom,1,3,female,1,1
3,29.0,7.8958,Mr. Pastcho Petroff,0,3,male,0,0
4,21.0,77.2875,Mr. Richard Frasar White,1,1,male,0,0

In [22]:
#Reading csv files
df = pd.read_csv('titanic.csv')

Checking number of rows/columns

In [23]:
df.shape

(887, 8)

In [24]:
df.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Siblings/Spouses Aboard',
       'Parents/Children Aboard', 'Fare'],
      dtype='object')

Viewing a sample of the data

In [25]:
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

Sometimes the number of features is too large and you want a transposed view, you can do the following.

In [26]:
df.tail(2).T

                                          885                 886
Survived                                    1                   0
Pclass                                      1                   3
Name                     Mr. Karl Howell Behr  Mr. Patrick Dooley
Sex                                      male                male
Age                                        26                  32
Siblings/Spouses Aboard                     0                   0
Parents/Children Aboard                     0                   0
Fare                                       30                7.75

In [27]:
#datatypes of columns
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
Survived                   887 non-null int64
Pclass                     887 non-null int64
Name                       887 non-null object
Sex                        887 non-null object
Age                        887 non-null float64
Siblings/Spouses Aboard    887 non-null int64
Parents/Children Aboard    887 non-null int64
Fare                       887 non-null float64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.5+ KB

In [29]:
#information about real valued features columns
df.describe()

,Survived,Pclass,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
count,887.000000,887.000000,887.000000,887.000000,887.000000,887.00000
mean,0.385569,2.305524,29.471443,0.525366,0.383315,32.30542
std,0.487004,0.836662,14.121908,1.104669,0.807466,49.78204
min,0.000000,1.000000,0.420000,0.000000,0.000000,0.00000
25%,0.000000,2.000000,20.250000,0.000000,0.000000,7.92500
50%,0.000000,3.000000,28.000000,0.000000,0.000000,14.45420
75%,1.000000,3.000000,38.000000,1.000000,0.000000,31.13750
max,1.000000,3.000000,80.000000,8.000000,6.000000,512.32920

Assigning datatypes

In [30]:
df['Survived'] = pd.Categorical(df['Survived'])
df['Pclass'] = pd.Categorical(df['Pclass'])
df['Sex'] = pd.Categorical(df['Sex'])
df['Siblings/Spouses Aboard'] = pd.Categorical(df['Siblings/Spouses Aboard'])
df['Parents/Children Aboard'] = pd.Categorical(df['Parents/Children Aboard'])

#df['Age'] = pd.to_numeric(df['Age'])

In [31]:
df.describe()

              Age       Fare
count  887.000000  887.00000
mean    29.471443   32.30542
std     14.121908   49.78204
min      0.420000    0.00000
25%     20.250000    7.92500
50%     28.000000   14.45420
75%     38.000000   31.13750
max     80.000000  512.32920

In [32]:
#datatypes of columns
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
Survived                   887 non-null category
Pclass                     887 non-null category
Name                       887 non-null object
Sex                        887 non-null category
Age                        887 non-null float64
Siblings/Spouses Aboard    887 non-null category
Parents/Children Aboard    887 non-null category
Fare                       887 non-null float64
dtypes: category(5), float64(2), object(1)
memory usage: 26.2+ KB

#### Column Renaming

In [33]:
df.columns = [col.upper() for col in df]

In [34]:
df.columns

Index(['SURVIVED', 'PCLASS', 'NAME', 'SEX', 'AGE', 'SIBLINGS/SPOUSES ABOARD',
       'PARENTS/CHILDREN ABOARD', 'FARE'],
      dtype='object')

In [35]:
df.rename(columns = {'PCLASS':'TravelClass'}, inplace = True)

In [36]:
df.columns

Index(['SURVIVED', 'TravelClass', 'NAME', 'SEX', 'AGE',
       'SIBLINGS/SPOUSES ABOARD', 'PARENTS/CHILDREN ABOARD', 'FARE'],
      dtype='object')

#### Handling duplicates

In [37]:
#making a temporary variable to understand duplicates

temp = pd.concat([df,df],ignore_index=True)
temp.shape

(1774, 8)

In [38]:
?df.drop_duplicates

In [39]:
temp.drop_duplicates(inplace=True)

#temp1 = temp.drop_duplicates()

temp.shape

(887, 8)

#### Handling missing values

In [40]:
df.isna().sum()

SURVIVED                   0
TravelClass                0
NAME                       0
SEX                        0
AGE                        0
SIBLINGS/SPOUSES ABOARD    0
PARENTS/CHILDREN ABOARD    0
FARE                       0
dtype: int64

1. Dropping Missing Values

In [171]:
df.dropna(inplace=True)

2. Imputation

In [172]:
#categorical / replacing with mode
df['SURVIVED'].fillna(df['SURVIVED'].mode()[0],inplace=True)

In [173]:
#continuous / replacing with mean
df['AGE'].fillna(df['AGE'].mean(),inplace=True)

#### Slicing and Dicing

In [180]:
#selecting a single column
age_np = df[['AGE']].values
print(type(age_np))


age_df = df[['AGE']]
print(type(age_df))

<class 'numpy.ndarray'>
<class 'pandas.core.frame.DataFrame'>

In [183]:
#selecting multiple columns
all_categorical_variables = df[['AGE','SURVIVED','TravelClass']]
all_categorical_variables.head()

    AGE SURVIVED TravelClass
0  22.0        0           3
1  38.0        1           1
2  26.0        1           3
3  35.0        1           1
4  35.0        0           3

In [195]:
#selecting a subset of the dataframe, dataframe.loc returns the index of the observations which satisfy the condition and fetches the entire row 

#observations with age = 30, male, whose fare was > 10
df_age30 = df.loc[(df['AGE']==30) & (df['SEX']=='male') & (df['FARE']>=10)]
print(df_age30.shape)
df_age30.head(5)

(9, 8)

,SURVIVED,TravelClass,NAME,SEX,AGE,SIBLINGS/SPOUSES ABOARD,PARENTS/CHILDREN ABOARD,FARE
177,0,2,Mr. Reginald Hale,male,30.0,0,0,13.0000
212,0,2,Mr. Hans Kristensen Givard,male,30.0,0,0,13.0000
218,0,2,Mr. Walter Harris,male,30.0,0,0,10.5000
252,0,3,Mr. William Arthur Lobb,male,30.0,1,0,16.1000
293,0,1,Mr. Ervin G Lewy,male,30.0,0,0,27.7208

#### Aggregating and Grouping

In [216]:
df.groupby('TravelClass')['FARE'].sum()

TravelClass
1    18177.4125
2     3801.8417
3     6675.6535
Name: FARE, dtype: float64

In [227]:
siblings = df['SIBLINGS/SPOUSES ABOARD'].value_counts()
siblings

0    604
1    209
2     28
4     18
3     16
8      7
5      5
Name: SIBLINGS/SPOUSES ABOARD, dtype: int64

In [41]:
df['DEAD/ALIVE'] = df['SURVIVED'].apply(lambda x: 'dead' if x==0 else 'alive)

SyntaxError: EOL while scanning string literal (<ipython-input-41-ed6275ee6617>, line 1)

In [230]:
df['DEAD/ALIVE'].value_counts()

alive    545
dead     342
Name: DEAD/ALIVE, dtype: int64

CheatSheet: https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf